:PROPERTIES:
:ID:       90e5da87-b00f-4fb2-8330-78c6123f9a64
:END:
#+TITLE: Nixos: Repl Output and Hardware Options
#+CATEGORY: slips
#+TAGS:
*** One does not simple "do it correcly"

Need to learn nix environment setup.

#+begin_quote
it seems everyone "just uses flake.nix"...

Flakes convolute control over the reproducibility of nix. great for average
users & great for startups, but if you want it used for real by large corps,
it needs to be with channels.

Channels, unfortunately, are very very complicated to manage.
#+end_quote

See [[https://github.com/NixOS/nix-mode/blob/master/nix-repl.el#L190-L218][nix-repl.el]]: the output includes escape chars... =nix repl= lacks a
=--no-color= option and vociferously ignores =TERM=dumb=...

+ which means you can't run some =nix= commands over Emacs' Tramp ...
+ or run them using =org-babel= ... not without without =ob-nix=
  - when running =:p config.hardware.alsa= to write the block above to stdout, I
    get =Error (org-babel): ... invalid search bound, wrong side of point=
  - looking into the =nix-repl.el= code, it scans for control chars to remove,
    but mostly allows

#+begin_src shell :results output verbatim
cat nixrepl-0xqegC # nope
#+end_src

=ob-nix= and =M-x nix-repl= retain the control chars. babel can filter some of
them out. =common-lisp= uses =^L= as a =form-feed= delimiter. the same char can add
smart page-down functionality to source code (in emacs). =embark= also uses
this.

#+begin_src nix
{ bar = "foobstermeister"; }
#+end_src

#+RESULTS:
: { bar = "foobstermeister"; }

